"""
任务描述

18位身份证号码第7 ~ 10位为出生年份(四位数)，第11 ~ 12位为出生月份，第13 ~ 14位代表出生日期，第17位代表性别，奇数为男，偶数为女。 用户输入一个合法的身份证号，请输出用户的出生年月日和性别。（不要求较验输入的合法性，月份和日期均为2位数表示）

输入格式
输入一个合法的身份证号字符串

输出格式
类似以下格式输出：

出生：1995年11月11日
性别：女

示例 1
输入：
110111199511111101    

输出：
出生：1995年11月11日
性别：女
"""

id_number = input()
birth_year = id_number[6:10]
birth_month = id_number[10:12]
birth_day = id_number[12:14]
gender = "男" if int(id_number[16]) % 2 == 1 else "女"

print(f"出生：{birth_year}年{birth_month}月{birth_day}日")
print(f"性别：{gender}")