"""
模拟通讯录的数据添加功能。

def menu():
    print('''\n欢迎使用PYTHON学生通讯录
1：添加学生
2：删除学生
3：修改学生信息
4：搜索学生
5：显示全部学生信息
6：退出并保存''')
dic={'张自强': ['12652141777', '材料'], '庚同硕': ['14388240417', '自动化'], '王岩': ['11277291473', '文法']}
要求编写程序
首先输出字典原始数据，再调用menu函数输出用户选择界面，接下来读用户输入：
(1) 输入‘1’ 进行添加学生，输入姓名，如果该姓名已存在，则输出“Fail”的提示信息，如果不存在，继续输入电话和所在学院。添加完毕后输出“Success”提示信息。
无论是否添加成功，结束后需要输出操作后的字典数据。
(2) 如果输入其他选项，无需再读姓名，直接输出“ERROR”。

输入格式

1
杨彪
11002345678
材料

输出格式

{'张自强': ['12652141777', '材料'], '庚同硕': ['14388240417', '自动化'], '王岩': ['11277291473', '文法']}
欢迎使用PYTHON学生通讯录
1：添加学生
2：删除学生
3：修改学生信息
4：搜索学生
5：显示全部学生信息
6：退出并保存
1
杨彪
11002345678
材料
Success
{'张自强': ['12652141777', '材料'], '庚同硕': ['14388240417', '自动化'], '王岩': ['11277291473', '文法'], '杨彪': ['11002345678', '材料']}
示例 1

输入：
1
杨彪
11002345678
材料
输出：
{'张自强': ['12652141777', '材料'], '庚同硕': ['14388240417', '自动化'], '王岩': ['11277291473', '文法']}
欢迎使用PYTHON学生通讯录
1：添加学生
2：删除学生
3：修改学生信息
4：搜索学生
5：显示全部学生信息
6：退出并保存
#输入数据
{'张自强': ['12652141777', '材料'], '庚同硕': ['14388240417', '自动化'], '王岩': ['11277291473', '文法'], '杨彪': ['11002345678', '材料']}

示例 2

输入：
1
张自强
输出：
{'张自强': ['12652141777', '材料'], '庚同硕': ['14388240417', '自动化'], '王岩': ['11277291473', '文法']}

欢迎使用PYTHON学生通讯录
1：添加学生
2：删除学生
3：修改学生信息
4：搜索学生
5：显示全部学生信息
6：退出并保存
#输入数据
{'张自强': ['12652141777', '材料'], '庚同硕': ['14388240417', '自动化'], '王岩': ['11277291473', '文法'], '杨彪': ['11002345678', '材料']}
"""

def menu():
    print('''\n欢迎使用PYTHON学生通讯录
1：添加学生
2：删除学生
3：修改学生信息
4：搜索学生
5：显示全部学生信息
6：退出并保存''')


dic = {'张自强': ['12652141777', '材料'],
       '庚同硕': ['14388240417', '自动化'],
       '王岩': ['11277291473', '文法']}

print(dic)
menu()

choice = input().strip()

if choice == '1':
    name = input().strip()
    if name in dic:
        print('Fail')
    else:
        phone = input().strip()
        college = input().strip()
        dic[name] = [phone, college]
        print('Success')
else:
    print('ERROR')

print(dic)