"""
本关任务：输入月份和日期，输出对应的星座名。
已知12星座的日期如下：白羊座3.21-4.19、金牛座4.20-5.20、双子座5.21-6.21、巨蟹座6.22-7.22、狮子座7.23-8.22、处女座8.23-9.22、天秤座9.23-10.23、天蝎座10.24-11.22、射手座11.23-12.21、魔羯座12.22-1.19、水瓶座1.20-2.18、双鱼座2.19-3.20。

测试输入：12 22
预期输出：魔羯座

测试输入：5 3
预期输出：金牛座
"""

# 已知12星座的日期如下：
# 白羊座3.21-4.19、金牛座4.20-5.20、双子座5.21-6.21、巨蟹座6.22-7.22
# 狮子座7.23-8.22、处女座8.23-9.22、天秤座9.23-10.23、天蝎座10.24-11.22
# 射手座11.23-12.21、魔羯座12.22-1.19、水瓶座1.20-2.18、双鱼座2.19-3.20

month, day = map(int, input().split())

# 开始补充代码，输出格式必须和样例一致

CONSTELLATIONS = [
	("魔羯座", (12, 22), (1, 19)),
	("水瓶座", (1, 20), (2, 18)),
	("双鱼座", (2, 19), (3, 20)),
	("白羊座", (3, 21), (4, 19)),
	("金牛座", (4, 20), (5, 20)),
	("双子座", (5, 21), (6, 21)),
	("巨蟹座", (6, 22), (7, 22)),
	("狮子座", (7, 23), (8, 22)),
	("处女座", (8, 23), (9, 22)),
	("天秤座", (9, 23), (10, 23)),
	("天蝎座", (10, 24), (11, 22)),
	("射手座", (11, 23), (12, 21))
]

for constellation, start, end in CONSTELLATIONS:
	if (month == start[0] and day >= start[1]) or (month == end[0] and day <= end[1]):
		print(constellation)
		break
